import { buttonVariants } from "@/components/ui/button";
import { cn } from "@/lib/utils";
import Link from "next/link";
import { siteConfig } from "@/config/site";

export default function IndexPage() {
    return (
        <>
          <section className="pt-6 md:pt-10 lg:py-32 pb-8 md:pb-12 mx-4 md:mx-10 lg:mx-20">
            <div className="container mx-auto text-center flex flex-col items-center gap-4  max-w-[64rem]">
                <Link
                href={siteConfig.links.x}
                className="bg-muted px-4 py-1.5 rounded-2xl font-medium text-sm "
                >
                Xをフォローする
                </Link>
                <h1  className="font-extrabold text-3xl sm:text-5xl md:text-6xl lg:text-7xl">
                    Post Writer</h1>
                <p className="text-muted-foreground  sm:text-xl leading-normal max-w-[42rem]">
                 このアプリケーションはユーザーが自由に投稿をポストする事が出来ます
                </p>
            <div className="space-x-4">
                <Link
                href={"/login"}
                className={cn(buttonVariants({size : "lg" }))}
                >
                はじめる
                </Link>
                <Link
                href={siteConfig.links.github}
                className={cn(buttonVariants({size : "lg", variant : "outline" }))}
                target="_blank"
                rel="noreferrer"
                >
                Github
                </Link>
            </div>
            </div>
          </section>

          <section id="features" className="container py-8 md:py-12 lg:py-24 bg-slate-50 space-y-6">
            <div className="text-center space-y-6 max-w-[58rem] mx-auto">
                <h2 className="font-extrabold text-3xl md:text-6xl">
                    サービスの特徴
                </h2>
            <p className="text-muted-foreground sm:text-lg sm:leading-7">
                このプロジェクトはモダンな技術スタックを使って作られたwebアプリケーションです。
                マークダウン形式でブログ投稿が出来ます。
            </p>
            </div>

            <div className=" mx-auto grid sm:grid-cols-2 md:grid-cols-3 gap-4 max-w-[64rem]">
                <div className="bg-background border p-2 rounded-lg">
                    <div className="flex flex-col justify-between p-6  h-[180px]">
                    <svg xmlns="http://www.w3.org/2000/svg"
                     width="45"
                     height="45"
                     viewBox="0 0 32 32">
                    <path d="M29.874 13.964A14.058 14.058 0 0 0 20.3 2.653a14.74 14.74 0 0 0-2.915-.61c-.263-.027-2.072-.057-2.3-.035c-.06 0-.252.024-.424.038A14.034 14.034 0 0 0 4.6 7.848a13.855 13.855 0 0 0-2.471 6.116A10.731 10.731 0 0 0 2 16a10.737 10.737 0 0 0 .126 2.039A14.055 14.055 0 0 0 11.7 29.352a14.772 14.772 0 0 0 2.956.613a25.525 25.525 0 0 0 2.682 0a14.139 14.139 0 0 0 5.045-1.475c.24-.123.287-.156.254-.183s-1.048-1.393-2.28-3.057l-2.239-3.024l-2.8-4.152c-1.544-2.282-2.814-4.148-2.825-4.148s-.022 1.841-.027 4.094a32.213 32.213 0 0 1-.06 4.2a.5.5 0 0 1-.241.249c-.088.044-.165.052-.578.052h-.473l-.126-.079a.517.517 0 0 1-.184-.2l-.057-.123l.005-5.487l.009-5.49l.084-.107a.768.768 0 0 1 .2-.167c.112-.054.156-.06.629-.06c.559 0 .652.022.8.181c.041.044 1.56 2.331 3.377 5.087s4.3 6.519 5.524 8.366L23.59 27.8l.112-.074a14.357 14.357 0 0 0 2.877-2.526a13.932 13.932 0 0 0 3.295-7.156A10.737 10.737 0 0 0 30 16a10.731 10.731 0 0 0-.126-2.036Zm-8.761 1.855l-.008 4.921l-.868-1.33l-.87-1.33V14.5c0-2.312.011-3.612.027-3.675a.558.558 0 0 1 .271-.345c.112-.058.153-.063.583-.063c.4 0 .476.005.566.055a.546.546 0 0 1 .277.323c.022.074.027 1.595.022 5.024Z"/>
                    </svg>
                    <div className="space-y-2">
                        <h3 className="font-bold">Next.js</h3>
                        <p className="text-sm text-muted-foreground">
                            Next.jsはReactのフレームワークで、SSRやSSGをサポートしています。
                        </p>
                    </div>

                    </div>
                </div>
                <div className="bg-background border p-2 rounded-lg">
                    <div className="flex flex-col justify-between p-6  h-[180px]">
                    <svg xmlns="http://www.w3.org/2000/svg"
                     width="45"
                     height="45"
                     viewBox="0 0 32 32">
                    <path d="M29.874 13.964A14.058 14.058 0 0 0 20.3 2.653a14.74 14.74 0 0 0-2.915-.61c-.263-.027-2.072-.057-2.3-.035c-.06 0-.252.024-.424.038A14.034 14.034 0 0 0 4.6 7.848a13.855 13.855 0 0 0-2.471 6.116A10.731 10.731 0 0 0 2 16a10.737 10.737 0 0 0 .126 2.039A14.055 14.055 0 0 0 11.7 29.352a14.772 14.772 0 0 0 2.956.613a25.525 25.525 0 0 0 2.682 0a14.139 14.139 0 0 0 5.045-1.475c.24-.123.287-.156.254-.183s-1.048-1.393-2.28-3.057l-2.239-3.024l-2.8-4.152c-1.544-2.282-2.814-4.148-2.825-4.148s-.022 1.841-.027 4.094a32.213 32.213 0 0 1-.06 4.2a.5.5 0 0 1-.241.249c-.088.044-.165.052-.578.052h-.473l-.126-.079a.517.517 0 0 1-.184-.2l-.057-.123l.005-5.487l.009-5.49l.084-.107a.768.768 0 0 1 .2-.167c.112-.054.156-.06.629-.06c.559 0 .652.022.8.181c.041.044 1.56 2.331 3.377 5.087s4.3 6.519 5.524 8.366L23.59 27.8l.112-.074a14.357 14.357 0 0 0 2.877-2.526a13.932 13.932 0 0 0 3.295-7.156A10.737 10.737 0 0 0 30 16a10.731 10.731 0 0 0-.126-2.036Zm-8.761 1.855l-.008 4.921l-.868-1.33l-.87-1.33V14.5c0-2.312.011-3.612.027-3.675a.558.558 0 0 1 .271-.345c.112-.058.153-.063.583-.063c.4 0 .476.005.566.055a.546.546 0 0 1 .277.323c.022.074.027 1.595.022 5.024Z"/>
                    </svg>
                    <div className="space-y-2">
                        <h3 className="font-bold">Next.js</h3>
                        <p className="text-sm text-muted-foreground">
                            Next.jsはReactのフレームワークで、SSRやSSGをサポートしています。
                        </p>
                    </div>

                    </div>
                </div>
                <div className="bg-background border p-2 rounded-lg">
                    <div className="flex flex-col justify-between p-6  h-[180px]">
                    <svg xmlns="http://www.w3.org/2000/svg"
                     width="45"
                     height="45"
                     viewBox="0 0 32 32">
                    <path d="M29.874 13.964A14.058 14.058 0 0 0 20.3 2.653a14.74 14.74 0 0 0-2.915-.61c-.263-.027-2.072-.057-2.3-.035c-.06 0-.252.024-.424.038A14.034 14.034 0 0 0 4.6 7.848a13.855 13.855 0 0 0-2.471 6.116A10.731 10.731 0 0 0 2 16a10.737 10.737 0 0 0 .126 2.039A14.055 14.055 0 0 0 11.7 29.352a14.772 14.772 0 0 0 2.956.613a25.525 25.525 0 0 0 2.682 0a14.139 14.139 0 0 0 5.045-1.475c.24-.123.287-.156.254-.183s-1.048-1.393-2.28-3.057l-2.239-3.024l-2.8-4.152c-1.544-2.282-2.814-4.148-2.825-4.148s-.022 1.841-.027 4.094a32.213 32.213 0 0 1-.06 4.2a.5.5 0 0 1-.241.249c-.088.044-.165.052-.578.052h-.473l-.126-.079a.517.517 0 0 1-.184-.2l-.057-.123l.005-5.487l.009-5.49l.084-.107a.768.768 0 0 1 .2-.167c.112-.054.156-.06.629-.06c.559 0 .652.022.8.181c.041.044 1.56 2.331 3.377 5.087s4.3 6.519 5.524 8.366L23.59 27.8l.112-.074a14.357 14.357 0 0 0 2.877-2.526a13.932 13.932 0 0 0 3.295-7.156A10.737 10.737 0 0 0 30 16a10.731 10.731 0 0 0-.126-2.036Zm-8.761 1.855l-.008 4.921l-.868-1.33l-.87-1.33V14.5c0-2.312.011-3.612.027-3.675a.558.558 0 0 1 .271-.345c.112-.058.153-.063.583-.063c.4 0 .476.005.566.055a.546.546 0 0 1 .277.323c.022.074.027 1.595.022 5.024Z"/>
                    </svg>
                    <div className="space-y-2">
                        <h3 className="font-bold">Next.js</h3>
                        <p className="text-sm text-muted-foreground">
                            Next.jsはReactのフレームワークで、SSRやSSGをサポートしています。
                        </p>
                    </div>

                    </div>
                </div>
                <div className="bg-background border p-2 rounded-lg">
                    <div className="flex flex-col justify-between p-6 h-[180px]">
                    <svg xmlns="http://www.w3.org/2000/svg"
                     width="45"
                     height="45"
                     viewBox="0 0 32 32">
                    <path d="M29.874 13.964A14.058 14.058 0 0 0 20.3 2.653a14.74 14.74 0 0 0-2.915-.61c-.263-.027-2.072-.057-2.3-.035c-.06 0-.252.024-.424.038A14.034 14.034 0 0 0 4.6 7.848a13.855 13.855 0 0 0-2.471 6.116A10.731 10.731 0 0 0 2 16a10.737 10.737 0 0 0 .126 2.039A14.055 14.055 0 0 0 11.7 29.352a14.772 14.772 0 0 0 2.956.613a25.525 25.525 0 0 0 2.682 0a14.139 14.139 0 0 0 5.045-1.475c.24-.123.287-.156.254-.183s-1.048-1.393-2.28-3.057l-2.239-3.024l-2.8-4.152c-1.544-2.282-2.814-4.148-2.825-4.148s-.022 1.841-.027 4.094a32.213 32.213 0 0 1-.06 4.2a.5.5 0 0 1-.241.249c-.088.044-.165.052-.578.052h-.473l-.126-.079a.517.517 0 0 1-.184-.2l-.057-.123l.005-5.487l.009-5.49l.084-.107a.768.768 0 0 1 .2-.167c.112-.054.156-.06.629-.06c.559 0 .652.022.8.181c.041.044 1.56 2.331 3.377 5.087s4.3 6.519 5.524 8.366L23.59 27.8l.112-.074a14.357 14.357 0 0 0 2.877-2.526a13.932 13.932 0 0 0 3.295-7.156A10.737 10.737 0 0 0 30 16a10.731 10.731 0 0 0-.126-2.036Zm-8.761 1.855l-.008 4.921l-.868-1.33l-.87-1.33V14.5c0-2.312.011-3.612.027-3.675a.558.558 0 0 1 .271-.345c.112-.058.153-.063.583-.063c.4 0 .476.005.566.055a.546.546 0 0 1 .277.323c.022.074.027 1.595.022 5.024Z"/>
                    </svg>
                    <div className="space-y-2">
                        <h3 className="font-bold">Next.js</h3>
                        <p className="text-sm text-muted-foreground">
                            Next.jsはReactのフレームワークで、SSRやSSGをサポートしています。
                        </p>
                    </div>

                    </div>
                </div>
                <div className="bg-background border p-2 rounded-lg">
                    <div className="flex flex-col justify-between p-6  h-[180px]">
                    <svg xmlns="http://www.w3.org/2000/svg"
                     width="45"
                     height="45"
                     viewBox="0 0 32 32">
                    <path d="M29.874 13.964A14.058 14.058 0 0 0 20.3 2.653a14.74 14.74 0 0 0-2.915-.61c-.263-.027-2.072-.057-2.3-.035c-.06 0-.252.024-.424.038A14.034 14.034 0 0 0 4.6 7.848a13.855 13.855 0 0 0-2.471 6.116A10.731 10.731 0 0 0 2 16a10.737 10.737 0 0 0 .126 2.039A14.055 14.055 0 0 0 11.7 29.352a14.772 14.772 0 0 0 2.956.613a25.525 25.525 0 0 0 2.682 0a14.139 14.139 0 0 0 5.045-1.475c.24-.123.287-.156.254-.183s-1.048-1.393-2.28-3.057l-2.239-3.024l-2.8-4.152c-1.544-2.282-2.814-4.148-2.825-4.148s-.022 1.841-.027 4.094a32.213 32.213 0 0 1-.06 4.2a.5.5 0 0 1-.241.249c-.088.044-.165.052-.578.052h-.473l-.126-.079a.517.517 0 0 1-.184-.2l-.057-.123l.005-5.487l.009-5.49l.084-.107a.768.768 0 0 1 .2-.167c.112-.054.156-.06.629-.06c.559 0 .652.022.8.181c.041.044 1.56 2.331 3.377 5.087s4.3 6.519 5.524 8.366L23.59 27.8l.112-.074a14.357 14.357 0 0 0 2.877-2.526a13.932 13.932 0 0 0 3.295-7.156A10.737 10.737 0 0 0 30 16a10.731 10.731 0 0 0-.126-2.036Zm-8.761 1.855l-.008 4.921l-.868-1.33l-.87-1.33V14.5c0-2.312.011-3.612.027-3.675a.558.558 0 0 1 .271-.345c.112-.058.153-.063.583-.063c.4 0 .476.005.566.055a.546.546 0 0 1 .277.323c.022.074.027 1.595.022 5.024Z"/>
                    </svg>
                    <div className="space-y-2">
                        <h3 className="font-bold">Next.js</h3>
                        <p className="text-sm text-muted-foreground">
                            Next.jsはReactのフレームワークで、SSRやSSGをサポートしています。
                        </p>
                    </div>

                    </div>
                </div>
                <div className="bg-background border p-2 rounded-lg">
                    <div className="flex flex-col justify-between p-6  h-[180px]">
                    <svg xmlns="http://www.w3.org/2000/svg"
                     width="45"
                     height="45"
                     viewBox="0 0 32 32">
                    <path d="M29.874 13.964A14.058 14.058 0 0 0 20.3 2.653a14.74 14.74 0 0 0-2.915-.61c-.263-.027-2.072-.057-2.3-.035c-.06 0-.252.024-.424.038A14.034 14.034 0 0 0 4.6 7.848a13.855 13.855 0 0 0-2.471 6.116A10.731 10.731 0 0 0 2 16a10.737 10.737 0 0 0 .126 2.039A14.055 14.055 0 0 0 11.7 29.352a14.772 14.772 0 0 0 2.956.613a25.525 25.525 0 0 0 2.682 0a14.139 14.139 0 0 0 5.045-1.475c.24-.123.287-.156.254-.183s-1.048-1.393-2.28-3.057l-2.239-3.024l-2.8-4.152c-1.544-2.282-2.814-4.148-2.825-4.148s-.022 1.841-.027 4.094a32.213 32.213 0 0 1-.06 4.2a.5.5 0 0 1-.241.249c-.088.044-.165.052-.578.052h-.473l-.126-.079a.517.517 0 0 1-.184-.2l-.057-.123l.005-5.487l.009-5.49l.084-.107a.768.768 0 0 1 .2-.167c.112-.054.156-.06.629-.06c.559 0 .652.022.8.181c.041.044 1.56 2.331 3.377 5.087s4.3 6.519 5.524 8.366L23.59 27.8l.112-.074a14.357 14.357 0 0 0 2.877-2.526a13.932 13.932 0 0 0 3.295-7.156A10.737 10.737 0 0 0 30 16a10.731 10.731 0 0 0-.126-2.036Zm-8.761 1.855l-.008 4.921l-.868-1.33l-.87-1.33V14.5c0-2.312.011-3.612.027-3.675a.558.558 0 0 1 .271-.345c.112-.058.153-.063.583-.063c.4 0 .476.005.566.055a.546.546 0 0 1 .277.323c.022.074.027 1.595.022 5.024Z"/>
                    </svg>
                    <div className="space-y-2">
                        <h3 className="font-bold">Next.js</h3>
                        <p className="text-sm text-muted-foreground">
                            Next.jsはReactのフレームワークで、SSRやSSGをサポートしています。
                        </p>
                    </div>

                    </div>
                </div>
            </div>
            <div className="mx-auto md:max-w-[58rem] text-center">
                    <p className="text-muted-foreground sm:text-lg sm:leading-7">
                    Post Writerはログインするとブログ投稿が出来るようになります
                    </p>
            </div>
          </section>

          <section id="contact" className="container py-8 md:py-12 lg:py-24">
            <div className="max-w-[58rem] mx-auto text-center flex flex-col gap-4">
                <h2 className="font-extrabold text-3xl md:text-6xl">Contact Me</h2>
                <p className="text-muted-foreground sm:text-lg sm:leading-7">
                    もしもwebサービスが気に入った場合は下記XからDMでご連絡ください。
                    <br/>お仕事のご連絡をお待ちしております。
                </p>
                <Link
                href={siteConfig.links.x}
                className="underline underline-offset-4"
                target="_blank"
                rel="noreferrer"
                >
                    お仕事はXまで
                </Link>
            </div>

          </section>

        </>
    );
    }



